# Пользователь вводит целое трёхзначное число.
# Выведите сумму чисел числа.
a = str(input())
list_a = list(a)
print(int(list_a[0]) + int(list_a[1]) + int(list_a[2]))
